src/DataProcessors/ДобавлениеДоговорныхПозиций/ДобавлениеДоговорныхПозиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДобавлениеДоговорныхПозиций</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/ДоговорныеПозиции/ДоговорныеПозиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговорныеПозиции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОстатокПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорнаяПозиция</name>
    <type>
      <types>CatalogRef.ДоговорныеПозиции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ДобавлениеДоговорныхПозиций/Forms/Форма/Module.bsl
&НаСервере
Процедура ДобавитьНаСервере()
	Если Не ЗначениеЗаполнено(ДатаНачалаПоставки) Тогда
	Сообщить("Введите дату начала поставки!");
	Возврат;	
	КонецЕсли;
Запрос = Новый Запрос;

	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
		Если ТЧ.Пометка Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДоговорныеПозиции.Ссылка
			|ИЗ
			|	Справочник.ДоговорныеПозиции КАК ДоговорныеПозиции
			|ГДЕ
			|	ДоговорныеПозиции.Владелец = &Владелец
			|	И ДоговорныеПозиции.МПЗ = &МПЗ";
		Запрос.УстановитьПараметр("Владелец", Объект.Документ.Договор);
		Запрос.УстановитьПараметр("МПЗ", ТЧ.МПЗ);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ДП = ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла;
			Иначе
			ДП = Справочники.ДоговорныеПозиции.СоздатьЭлемент();
			ДП.Владелец = Объект.Документ.Договор;
			ДП.МПЗ = ТЧ.МПЗ;
			ДП.Записать();
			КонецЕсли; 	
		ДоговорныеПозиции = РегистрыСведений.ДоговорныеПозиции.СоздатьМенеджерЗаписи();
		ДоговорныеПозиции.Период = ДатаНачалаПоставки;
		ДоговорныеПозиции.ДоговорнаяПозиция = ДП.Ссылка;
		ДоговорныеПозиции.Количество = ТЧ.Количество;
		ДоговорныеПозиции.Цена = ТЧ.Цена;
		ДоговорныеПозиции.Валюта = Объект.Документ.Договор.Валюта;
		ДоговорныеПозиции.ОстатокПоДоговору = ТЧ.Количество;
		ДоговорныеПозиции.Записать(Истина);			
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
ДобавитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
ДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДокументПриИзмененииНаСервере()
Объект.ТабличнаяЧасть.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорныеПозиции.МПЗ
	|ИЗ
	|	Справочник.ДоговорныеПозиции КАК ДоговорныеПозиции
	|ГДЕ
	|	ДоговорныеПозиции.Владелец = &Владелец";
Запрос.УстановитьПараметр("Владелец", Объект.Документ.Договор);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Для каждого ТЧ Из Объект.Документ.ТабличнаяЧасть Цикл
		Если ТЧ.НЦ Тогда
		Продолжить;
		КонецЕсли; 
	ВыборкаДетальныеЗаписи.Сбросить();
		Если Не ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("МПЗ",ТЧ.МПЗ)) Тогда
		ТЧ_МПЗ = Объект.ТабличнаяЧасть.Добавить();
		ТЧ_МПЗ.Пометка = Истина;
		ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
		ТЧ_МПЗ.Количество = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
			Если Объект.Документ.Договор.Валюта = Константы.ОсновнаяВалюта.Получить() Тогда
				Если Объект.Документ.Договор.БезНДС Тогда
				ТЧ_МПЗ.Цена = ТЧ.Цена/ТЧ.ЕдиницаИзмерения.Коэффициент;
				Иначе
				ТЧ_МПЗ.Цена = (ТЧ.Цена*1.18)/ТЧ.ЕдиницаИзмерения.Коэффициент;
				КонецЕсли; 
			Иначе
				Если Объект.Документ.Договор.БезНДС Тогда
				ТЧ_МПЗ.Цена = ТЧ.ЦенаВалюта/ТЧ.ЕдиницаИзмерения.Коэффициент;
				Иначе
				ТЧ_МПЗ.Цена = (ТЧ.ЦенаВалюта*1.18)/ТЧ.ЕдиницаИзмерения.Коэффициент;
				КонецЕсли;
			КонецЕсли; 		
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
	Объект.Документ = Параметры.Документ;
	ДокументПриИзмененииНаСервере();	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СписокПочтовойРассылкиПриИзменении(Элемент)
СписокПочтовойРассылкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокПочтовойРассылкиПриИзмененииНаСервере()
ХранилищеОбщихНастроек.Сохранить("СписокРассылкиПоДоговорнымПозициям", "СписокПочтовойРассылки", СписокПочтовойРассылки);
КонецПроцедуры

&НаСервере
Функция ПолучитьEmailСотрудника()
Возврат(ПараметрыСеанса.Пользователь.Email);
КонецФункции

&НаСервере
Функция ПолучитьEmailПолучателя(Сотрудник)
Возврат(Сотрудник.Email);
КонецФункции

&НаСервере
Функция ПолучитьКонтрагента(Документ)
Возврат(СокрЛП(Документ.Контрагент.Наименование));
КонецФункции

&НаСервере
Функция ПолучитьДоговор(Документ)
Возврат(СокрЛП(Документ.Договор.Наименование));
КонецФункции

&НаСервере
Функция ПолучитьНомерДокумента(Документ)
Возврат(Документ.Номер);
КонецФункции

&НаСервере
Функция ПолучитьАвтораДокумента(Документ)
Возврат(Документ.Автор.Наименование);
КонецФункции

&НаСервере
Функция ПолучитьНаименованиеМПЗ(МПЗ)
Возврат(СокрЛП(МПЗ.Наименование));
КонецФункции

&НаКлиенте
Процедура ПочтоваяРассылка(Команда)
EmailСотрудника = ПолучитьEmailСотрудника();
Сообщение = Новый ИнтернетПочтовоеСообщение;
ИПП = Новый ИнтернетПочтовыйПрофиль; 

НастройкиПочты = ОбщийМодульВызовСервера.ПолучитьНастройкиПочты();
ИПП.АдресСервераSMTP = НастройкиПочты.АдресСервераSMTP; 
ИПП.ПортSMTP = НастройкиПочты.ПортSMTP;
ИПП.ВремяОжидания = 60; 
ИПП.Пароль = НастройкиПочты.ПарольПочтовогоСервера; 
ИПП.Пользователь = EmailСотрудника;
	Если СписокПочтовойРассылки.Количество() = 0 Тогда
	Сообщить("Нет списка почтовой рассылки!");
	Возврат;
	КонецЕсли;
Сообщение = Новый ИнтернетПочтовоеСообщение;
	 
	Для каждого Стр Из СписокПочтовойРассылки Цикл
    Сообщение.Получатели.Добавить(ПолучитьEmailПолучателя(Стр.Значение));
	КонецЦикла; 
Сообщение.Отправитель.Адрес = EmailСотрудника;

Сообщение.Тема = "Внесение договорных позиций по заказу поставщику"; 
Текст = "Здравствуйте!";
Текст = Текст + Символы.ПС + "";
Текст = Текст + Символы.ПС + "В договорные позиции не были вовремя внесены следующие МПЗ:";
Текст = Текст + Символы.ПС + "";
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
		Если ТЧ.Пометка Тогда
		Текст = Текст + Символы.ПС + ПолучитьНаименованиеМПЗ(ТЧ.МПЗ)+" (кол-во: "+ТЧ.Количество+", цена: "+ТЧ.Цена+")";	
		Текст = Текст + Символы.ПС + "";		
		КонецЕсли; 
	КонецЦикла;
Текст = Текст + Символы.ПС + "";
Текст = Текст + Символы.ПС + "Данные договорные позиции были внесены с датой начала поставки "+Формат(ДатаНачалаПоставки,"ДФ=dd.MM.yyyy")+". Просим проверить внесенные данные!";
Текст = Текст + Символы.ПС + "";
Текст = Текст + Символы.ПС + "Заказ поставщику №"+ПолучитьНомерДокумента(Объект.Документ)+", контрагент: "+ПолучитьКонтрагента(Объект.Документ)+" ("+ПолучитьДоговор(Объект.Документ)+")";
Текст = Текст + Символы.ПС + "";
Текст = Текст + Символы.ПС + "Автор документа: "+ПолучитьАвтораДокумента(Объект.Документ);
Текст = Текст + Символы.ПС + "";
Текст = Текст + Символы.ПС + "С уважением, отдел снабжения, email: "+EmailСотрудника;
Сообщение.Тексты.Добавить(Текст);	
 	
// Подключиться и отправить. 
Почта = Новый ИнтернетПочта; 
Почта.Подключиться(ИПП);
Почта.Послать(Сообщение); 
Почта.Отключиться();
ПоказатьОповещениеПользователя("Сообщение отправлено!");
//УдалитьФайлы(ИмяФайла);	
КонецПроцедуры
